; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v9 ?v13)
             (pred_2 ?v2 ?v11)
             (pred_11 ?v9 ?v11)
             (pred_7 ?v7 ?v9 )
	     (pred_1 ?v9)
             (pred_5 ?v10)
             (pred_3 ?v2)
             (pred_6 ?v11)
             (pred_12 ?v9)
             (pred_8 ?v2)
             (pred_9 ?v9)
             (pred_4 ))



(:action op_1
:parameters (?v4 ?v3 ?v6 ?v1)
:precondition (and (pred_5 ?v4) (pred_5 ?v3) (pred_3 ?v6) (pred_6 ?v1)
          (pred_10 ?v4 ?v3) (pred_2 ?v6 ?v1)
                   (pred_11 ?v3 ?v1) (pred_1 ?v4) 
                   (pred_12 ?v3) (pred_8 ?v6))
:effect (and  (pred_9 ?v3) (not (pred_12 ?v3))))


(:action op_4
:parameters (?v4 ?v5)
:precondition (and (pred_5 ?v4) (pred_5 ?v5)
               (pred_1 ?v4) (pred_10 ?v4 ?v5) (pred_9 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v4))))

(:action op_5
:parameters (?v4 ?v6)
:precondition (and (pred_5 ?v4) (pred_3 ?v6) 
                  (pred_1 ?v4) (pred_7 ?v6 ?v4) (pred_4 ))
:effect (and (pred_8 ?v6)
   (not (pred_7 ?v6 ?v4)) (not (pred_4 ))))


(:action op_2
:parameters (?v4 ?v12 ?v8)
:precondition (and (pred_5 ?v4) (pred_3 ?v12) (pred_3 ?v8)
                  (pred_1 ?v4) (pred_8 ?v8) (pred_7 ?v12 ?v4))
:effect (and (pred_8 ?v12) (pred_7 ?v8 ?v4)
        (not (pred_8 ?v8)) (not (pred_7 ?v12 ?v4))))

(:action op_3
:parameters (?v4 ?v6)
:precondition (and (pred_5 ?v4) (pred_3 ?v6) 
                  (pred_1 ?v4) (pred_8 ?v6))
:effect (and (pred_4 ) (pred_7 ?v6 ?v4) (not (pred_8 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_02 obj_09 obj_15 obj_11 obj_26 obj_16 obj_14 obj_27 obj_12 obj_07 obj_24 obj_29 obj_22 obj_17 obj_08 obj_10 obj_21 obj_01 obj_28 obj_05 obj_06 obj_30 obj_19 obj_20 obj_18
    obj_32 obj_23 obj_31
    obj_04 obj_13 obj_25 obj_03
    )

    (:init
       (pred_4)

       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_26)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_27)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_22)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_10)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_5 obj_28)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_30)
       (pred_5 obj_19)
       (pred_5 obj_20)
       (pred_5 obj_18)
       (pred_6 obj_32)
       (pred_6 obj_23)
       (pred_6 obj_31)
       (pred_3 obj_04)
       (pred_3 obj_13)
       (pred_3 obj_25)
       (pred_3 obj_03)

       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_15 obj_27)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_26 obj_07)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_14 obj_27)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_27 obj_15)
       (pred_10 obj_27 obj_14)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_26)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_29)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_29 obj_21)
       (pred_10 obj_29 obj_22)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_29 obj_24)
       (pred_10 obj_22 obj_01)
       (pred_10 obj_22 obj_17)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_22 obj_29)
       (pred_10 obj_17 obj_28)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_22)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_29)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_01 obj_28)
       (pred_10 obj_01 obj_22)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_28 obj_20)
       (pred_10 obj_28 obj_05)
       (pred_10 obj_28 obj_17)
       (pred_10 obj_28 obj_01)
       (pred_10 obj_05 obj_18)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_28)
       (pred_10 obj_06 obj_30)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_30 obj_21)
       (pred_10 obj_30 obj_06)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_28)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_18 obj_05)
       (pred_10 obj_18 obj_20)
       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_12 obj_14)
       (pred_12 obj_26)
       (pred_11  obj_11 obj_32)
       (pred_11  obj_02 obj_23)
       (pred_11  obj_14 obj_31)
       (pred_11  obj_26 obj_23)
       (pred_9 obj_09)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_27)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_24)
       (pred_9 obj_29)
       (pred_9 obj_22)
       (pred_9 obj_17)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_21)
       (pred_9 obj_01)
       (pred_9 obj_28)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_30)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_18)

       (pred_2  obj_04 obj_32)
       (pred_2  obj_13 obj_23)
       (pred_2  obj_25 obj_31)
       (pred_2  obj_03 obj_31)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_13 obj_19)
       (pred_7 obj_25 obj_17)
       (pred_7 obj_03 obj_28)
       (pred_1 obj_15)
    )

    (:goal (and
       (pred_7 obj_25 obj_19)
       (pred_7 obj_03 obj_17)
    ))
(:constraints
  (always (not (pred_1 obj_01)))
)
)

; plan
1. (op_4 obj_15 obj_27)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_27)
   goals met: 0 of 2
2. (op_4 obj_27 obj_22)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_22)
   goals met: 0 of 2
3. (op_4 obj_22 obj_17)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_17)
   goals met: 0 of 2
4. (op_4 obj_17 obj_28)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_28)
   goals met: 0 of 2
5. (op_5 obj_28 obj_03)
   deleted: (pred_7 obj_03 obj_28) (pred_4)
   added: (pred_8 obj_03)
   goals met: 0 of 2
6. (op_4 obj_28 obj_17)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_17)
   goals met: 0 of 2
7. (op_2 obj_17 obj_25 obj_03)
   deleted: (pred_8 obj_03) (pred_7 obj_25 obj_17)
   added: (pred_8 obj_25) (pred_7 obj_03 obj_17)
   goals met: 1 of 2
8. (op_4 obj_17 obj_28)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_28)
   goals met: 1 of 2
9. (op_4 obj_28 obj_20)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_20)
   goals met: 1 of 2
10. (op_4 obj_20 obj_19)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_19)
   goals met: 1 of 2
11. (op_2 obj_19 obj_13 obj_25)
   deleted: (pred_8 obj_25) (pred_7 obj_13 obj_19)
   added: (pred_8 obj_13) (pred_7 obj_25 obj_19)
   goals met: 2 of 2
